Repository: SteveShi/LaunchdManage
Catalog: LaunchdManage/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: (Range: -20 to 20, lower is higher priority)
zh_hans: (范围: -20 到 20，数值越低优先级越高)

source: %lld seconds
zh_hans: %lld 秒

source: Action
zh_hans: 操作

source: Active
zh_hans: 活跃中

source: Add Argument
zh_hans: 添加运行参数

source: Add Variable
zh_hans: 添加环境变量

source: All
zh_hans: 全部

source: Always
zh_hans: 始终常驻

source: Apply
zh_hans: 保存并应用

source: Are you sure you want to delete '%@'? This will stop the service and permanently delete its configuration file.
zh_hans: 您确定要删除“%@”吗？这将停止该服务并永久删除其配置文件。

source: Arguments
zh_hans: 运行参数

source: Arguments (argv)
zh_hans: 运行参数 (argv)

source: Calendar Intervals
zh_hans: 日历调度

source: Cancel
zh_hans: 取消

source: Categories
zh_hans: 分类

source: Category
zh_hans: 服务分类

source: Choose...
zh_hans: 选择...

source: Combined
zh_hans: 混合模式

source: Conditional
zh_hans: 条件常驻

source: Conditions
zh_hans: 触发条件

source: Configuration
zh_hans: 配置属性

source: Conflict: Both KeepAlive and StartInterval are enabled
zh_hans: 配置冲突：同时启用了 KeepAlive 与 StartInterval

source: Console Theme:
zh_hans: 终端主题：

source: Control
zh_hans: 服务控制

source: Control launchd Service
zh_hans: 控制 launchd 服务

source: CPU
zh_hans: CPU 占用率

source: Create
zh_hans: 创建

source: Create a new service
zh_hans: 创建新服务

source: Day %lld
zh_hans: 第 %lld 天

source: Default
zh_hans: 系统默认

source: Delay Value
zh_hans: 延迟值

source: Delete
zh_hans: 删除

source: Delete Service
zh_hans: 删除服务

source: Directory & Output Paths
zh_hans: 目录与重定向输出路径

source: Directory not accessible: %@
zh_hans: 目录无法访问：%@

source: Disable
zh_hans: 禁用

source: Disable Service
zh_hans: 禁用服务

source: Disabled
zh_hans: 已禁用

source: Display read-only system agents and daemons protected by SIP.
zh_hans: 显示受系统完整性保护 (SIP) 保护的只读系统代理和守护进程。

source: Enable
zh_hans: 启用

source: Enable Service
zh_hans: 启用服务

source: Enabled
zh_hans: 已启用

source: Environment Variables
zh_hans: 环境变量

source: Error
zh_hans: 错误

source: Error (%lld)
zh_hans: 错误 (代码: %lld)

source: Every minute
zh_hans: 每分钟

source: Executable program does not exist
zh_hans: 可执行程序路径不存在

# Failed to disable %@: %@
source: Failed to disable %1$@: %2$@
zh_hans: 禁用 %@ 失败：%@

# Failed to enable %@: %@
source: Failed to enable %1$@: %2$@
zh_hans: 启用 %@ 失败：%@

source: Failed to encode plist data
zh_hans: Plist 数据编码失败

# Failed to kickstart %@: %@
source: Failed to kickstart %1$@: %2$@
zh_hans: 强制启动 %@ 失败：%@

# Failed to load %@: %@
source: Failed to load %1$@: %2$@
zh_hans: 加载 %@ 失败：%@

source: Failed to load XML: %@
zh_hans: 加载 XML 失败：%@

source: Failed to register helper: %@
zh_hans: 特权辅助工具注册失败：%@

# Failed to send signal %d to %@: %@
source: Failed to send signal %1$d to %2$@: %3$@
zh_hans: 向 %@ 发送信号 %d 失败：%@

source: Failed to sync XML back to form: %@
zh_hans: 同步 XML 回表单失败：%@

# Failed to unload %@: %@
source: Failed to unload %1$@: %2$@
zh_hans: 卸载 %@ 失败：%@

source: Failed to unregister helper: %@
zh_hans: 注销特权辅助工具失败：%@

source: Filter logs...
zh_hans: 过滤日志...

source: Font Size:
zh_hans: 字号大小：

source: Friday
zh_hans: 星期五

source: General
zh_hans: 通用设置

source: Global Agents
zh_hans: 全局代理 (Global Agents)

source: Global Daemons
zh_hans: 系统守护进程 (Global Daemons)

source: Green
zh_hans: 经典绿

source: Helper Status:
zh_hans: 辅助工具状态：

source: Helper Tool
zh_hans: 特权辅助工具

source: Helper tool registered successfully.
zh_hans: 特权辅助工具注册成功。

source: Helper tool unregistered successfully.
zh_hans: 特权辅助工具已成功注销。

source: Hide Disabled Services
zh_hans: 隐藏已禁用的服务

source: Hide services that have been explicitly disabled in launchd.
zh_hans: 隐藏在 launchd 中已被显式禁用的服务。

source: Identity & General
zh_hans: 服务标识与通用

source: Install Helper Tool
zh_hans: 安装辅助工具

source: Interval Value
zh_hans: 运行时间间隔

source: Invalid plist format
zh_hans: 非法的 Plist 格式

source: Invalid plist format: %@
zh_hans: 非法的 Plist 格式：%@

source: It is a best practice to use reverse-domain format (e.g., com.steveshi.appname) to prevent naming collisions.
zh_hans: 推荐使用反向域名格式（例如 com.steveshi.appname）以防止命名冲突。

source: Keep Alive
zh_hans: 常驻运行 (KeepAlive)

source: Keep Alive Type
zh_hans: 常驻类型

source: KeepAlive instructs launchd to keep the process running continuously. StartInterval schedules it to launch periodically. Combining them usually yields unpredictable behavior.
zh_hans: KeepAlive 促使进程保持持续运行。StartInterval 用于让进程周期性启动。同时启用它们通常会导致不可预测的行为。

source: Key
zh_hans: 键 (Key)

source: Label
zh_hans: 服务标识 (Label)

source: Label cannot be empty
zh_hans: 服务标识不能为空

source: Label contains unusual characters
zh_hans: 服务标识包含非标准字符

source: Label does not use reverse-domain format
zh_hans: 服务标识未使用反向域名格式

source: Last Exit Code
zh_hans: 上次退出码

source: Launch Program
zh_hans: 启动运行程序

source: launchd executes tasks from the system root domain. Using relative paths (e.g. 'myscript.sh') may fail unless WorkingDirectory is properly set.
zh_hans: launchd 从系统根域执行任务。除非正确设置了工作目录 (WorkingDirectory)，否则使用相对路径（如 'myscript.sh'）可能会加载失败。

source: Launchd labels should typically contain only alphanumeric characters, dots, and hyphens.
zh_hans: launchd 标识通常应仅包含字母、数字、点(.)和连字符(-)。

source: launchd Service
zh_hans: launchd 服务

source: List launchd Services
zh_hans: 列出 launchd 服务

source: Load
zh_hans: 加载服务

source: Load Failed
zh_hans: 加载失败

source: Load Service
zh_hans: 加载服务

source: Loaded
zh_hans: 已加载

source: Loading configuration...
zh_hans: 正在加载配置...

source: Loading Services...
zh_hans: 正在加载服务列表...

source: Log Source:
zh_hans: 日志来源：

source: Memory
zh_hans: 内存占用

source: Minute %lld
zh_hans: 第 %lld 分钟

source: Missing Label key in plist: %@
zh_hans: Plist 中缺少 Label 键：%@

source: Monday
zh_hans: 星期一

source: Month %lld
zh_hans: 第 %lld 月

source: Must specify Program or ProgramArguments
zh_hans: 必须指定可执行程序 (Program) 或运行参数 (ProgramArguments)

source: New Service
zh_hans: 新建服务

source: Nice (Priority adjustment)
zh_hans: Nice 值 (优先级调整)

source: No
zh_hans: 否

source: No executable program specified
zh_hans: 未指定任何可执行程序

source: No logs found
zh_hans: 未找到任何日志输出

source: No Service Selected
zh_hans: 未选择任何服务

source: No standard error redirection configured.
zh_hans: 未配置标准错误输出重定向。

source: No standard output redirection configured.
zh_hans: 未配置标准输出重定向。

source: Not Found
zh_hans: 未找到

source: Not Loaded
zh_hans: 未加载

source: Not Registered
zh_hans: 未注册

source: Not Running
zh_hans: 未运行

source: Ocean
zh_hans: 海洋蓝

source: OK
zh_hans: 好

source: Only if crashed
zh_hans: 仅在崩溃时常驻

source: Only if successful exit
zh_hans: 仅在正常退出时常驻

source: Open in New Window
zh_hans: 在新窗口打开编辑

source: Operations:
zh_hans: 特权操作：

source: Overview
zh_hans: 运行概览

source: Parent directory for %@ does not exist
zh_hans: “%@” 的父级目录不存在

source: Paths
zh_hans: 相关文件路径

source: Perform actions like load, unload, start, or stop on a selected service.
zh_hans: 对所选服务执行加载、卸载、启动或停止等操作。

source: PID
zh_hans: 进程 ID (PID)

source: Please provide a unique identifier for your service.
zh_hans: 请为您的服务提供一个全局唯一的标识符。

source: Plist file not found: %@
zh_hans: Plist 配置文件未找到：%@

source: Plist Path
zh_hans: Plist 配置文件路径

source: Priority Value
zh_hans: 优先级数值

source: Process Info
zh_hans: 运行进程信息

source: Process is not running.
zh_hans: 该服务进程目前未运行。

source: Process Parameters
zh_hans: 进程与系统参数

source: Process Type
zh_hans: 进程类型

source: Program
zh_hans: 可执行程序

source: Program Path
zh_hans: 程序物理路径

source: Refresh
zh_hans: 刷新列表

source: Refresh service list
zh_hans: 刷新服务列表

source: Relative path used for program
zh_hans: 程序路径使用了相对路径

source: Requires Approval
zh_hans: 需要密码授权

source: Resource Usage
zh_hans: 系统资源占用

source: Retrieve all launchd services registered in the system.
zh_hans: 获取系统中注册的所有 launchd 服务列表。

source: Reveal in Finder
zh_hans: 在 Finder 中显示

source: Revert
zh_hans: 撤销修改

source: Run at Load
zh_hans: 加载时立即运行 (RunAtLoad)

source: Running
zh_hans: 运行中

source: Running (PID: %lld)
zh_hans: 运行中 (PID: %lld)

source: Saturday
zh_hans: 星期六

source: Schedule
zh_hans: 周期性调度

source: Scheduling & Keep Alive
zh_hans: 调度运行与常驻运行

source: Search Services
zh_hans: 搜索服务列表...

source: seconds
zh_hans: 秒

source: seconds (e.g. 3600 for 1 hour)
zh_hans: 秒 (例如：3600 秒代表 1 小时)

source: Select a service from the service list to view its details.
zh_hans: 请从服务列表选择一个服务以查看其详细配置及运行状态。

source: Select a service from the sidebar to view its details.
zh_hans: 请从左侧栏选择一个服务以查看其详细配置及运行状态。

source: Serialization failed: %@
zh_hans: 数据序列化失败：%@

source: Service
zh_hans: 服务条目

source: Service '%@' not found.
zh_hans: 服务“%@”未找到。

source: Service Action
zh_hans: 服务控制指令

source: Service Label is empty
zh_hans: 服务标识为空

source: Services
zh_hans: 服务管理

source: Services:
zh_hans: 服务列表：

source: Show System Services
zh_hans: 显示系统只读服务

source: Show/Hide Inspector
zh_hans: 显示/隐藏右侧监控栏

source: Standard Error
zh_hans: 标准错误 (Stderr)

source: Standard Error Path
zh_hans: 标准错误输出路径

source: Standard Out Path
zh_hans: 标准输出路径

source: Standard Output
zh_hans: 标准输出 (Stdout)

source: Start
zh_hans: 启动服务

source: Start Interval
zh_hans: 定时运行间隔

source: Start Interval (Seconds)
zh_hans: 定时运行时间间隔 (秒)

source: Start Service
zh_hans: 启动服务

source: Status
zh_hans: 运行状态

source: Stop
zh_hans: 停止服务

source: Stop Service
zh_hans: 停止服务

source: Stopped
zh_hans: 已停止

source: Stream
zh_hans: 实时流式日志

# Successfully executed %@ on %@.
source: Successfully executed %1$@ on %2$@.
zh_hans: 已成功在 %2$@ 上执行 %1$@。

source: Sunday
zh_hans: 星期日

source: System Agents
zh_hans: 只读系统代理 (System Agents)

source: System Daemons
zh_hans: 只读系统进程 (System Daemons)

source: System Log
zh_hans: 系统统一日志

source: Terminal
zh_hans: 日志终端

source: The folder '%@' was not found. launchd cannot create log files if their parent directory does not exist, which will block service loading.
zh_hans: 未找到目录“%@”。若日志文件的父目录不存在，launchd 将无法创建日志，这会导致服务加载失败。

source: The path '%@' was not found on this system. Please check if the target script or application is installed.
zh_hans: 此系统上未找到路径“%@”。请检查目标程序或脚本是否已正确安装。

source: The privileged helper tool is required to manage global launch daemons under /Library/LaunchDaemons with root authority.
zh_hans: 管理 /Library/LaunchDaemons 下的全局守护进程需要特权辅助工具以获取 Root 权限。

source: Throttle Interval
zh_hans: 限流间隔时间 (ThrottleInterval)

source: Thursday
zh_hans: 星期四

source: Toggle Inspector
zh_hans: 显示/隐藏监控栏

source: Toggle XML Code View
zh_hans: 切换 XML 代码视图

source: Tuesday
zh_hans: 星期二

source: Uninstall Helper Tool
zh_hans: 注销特权辅助工具

source: Unknown
zh_hans: 未知状态

source: Unload
zh_hans: 卸载服务

source: Unload Service
zh_hans: 卸载服务

source: Uptime
zh_hans: 运行时长 (Uptime)

source: User Agents
zh_hans: 用户代理 (User Agents)

source: Value
zh_hans: 值 (Value)

source: Variables
zh_hans: 环境变量

source: Wednesday
zh_hans: 星期三

source: White
zh_hans: 经典白

source: Working Directory
zh_hans: 工作目录 (WorkingDirectory)

source: XML
zh_hans: XML 源代码

source: Yes
zh_hans: 是

source: You have unsaved changes
zh_hans: 您有未保存的更改

source: You must specify either the Program path or at least one argument in ProgramArguments.
zh_hans: 您必须指定可执行程序路径，或者在 ProgramArguments 中至少指定一个参数。
